## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.acr.azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d3a87bbd-6423-4f94-89d3-beb4a1d1ad12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4/resourceGroups/huggingface-dev/providers/Microsoft.ContainerRegistry/registries/devacr830ofj"
      + skip_service_principal_aad_check = false
    }

  # module.grafana.azurerm_role_assignment.grafana_admin will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be15d227-89e5-4392-9aa5-6a779ae8b617"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4/resourceGroups/huggingface-dev/providers/Microsoft.Dashboard/grafana/grafana-dev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.grafana.azurerm_role_assignment.grafana_subscription_reader will be created
  + resource "azurerm_role_assignment" "grafana_subscription_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be15d227-89e5-4392-9aa5-6a779ae8b617"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.grafana.null_resource.grafana_role_assignment will be destroyed
  # (because null_resource.grafana_role_assignment is not in configuration)
  - resource "null_resource" "grafana_role_assignment" {
      - id = "3105825198247469602" -> null
    }

  # module.log_analytics.azurerm_role_assignment.aks_prometheus will be created
  + resource "azurerm_role_assignment" "aks_prometheus" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "bdcbdd5c-d8df-489f-9232-938714eb05f3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4/resourceGroups/huggingface-dev/providers/Microsoft.Monitor/accounts/prometheus-dev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```
</details>